#11. Генератор персональной веб-страницы. Напишите программу, которая запрашивает у пользователя его имя и просит 
# пользователя ввести предложение, которое его описывает. Вот пример экрана программы:
# Введите свое имя: Джулия Тейлор [Enter] Опишите себя: Моя специализация - информатика, 
# я являюсь членом джаз-клуба и надеюсь стать разработчиком мобильных приложений после того, 
# как получу высшее образование. [Enter] После того как пользователь ввел требуемые входные данные, 
# программа должна создать файл HTML и записать в него полученные входные данные для создания простой веб-страницы. 
# Вот пример содержимого файла HTML с использованием ранее показанных входных данных:
'''<html>
    <head>
    </head>
    <body>
    <center>
    < hl>Джу лия Те йлор </hl >
    </center>
    <hr /> Моя специализация - информатика, я являюсь члено м джаз-клуба и надеюсь стать разработчиком мобильных приложений после того, как получу высшее образование. <hr />
    </body>
</html>'''



def generate_web_page():
    user_name = input("Enter your name: ")

    user_description = input("Describe yourself: ")

    html_content = f"""
    <html>
    <head></head>
    <body>
        <center>
            <h1>{user_name}</h1>
        </center>
        <hr />
        <p>{user_description}</p>
        <hr />
    </body>
    </html>
    """

    with open("user_page.html", "w") as file:
        file.write(html_content)

    print(f"Web page saved to the 'user_page.html' file.")

if __name__ == "__main__":
    generate_web_page()
