#2. Викторина со столицами. Напишите программу, которая создает словарь, содержащий в качестве ключей названия американских штатов 
# и в качестве значений - их столицы. (Список штатов и соответствующих им столиц можно найти в Интернете.) Затем программа должна 
# провести викторину, случайным образом выводя название штата и предлагая ввести его столицу. Программа должна провести подсчет
# количества правильных и неправильных ответов. (Как вариант, вместо американских штатов программа может использовать названия 
# стран и их столиц; названия достопримечательностей и городов, в которых эти шедевры находятся, и т. д.)

import random
# Создаем словарь с достопримечательностями и городами
landmarks = {
    "Статуя Свободы": "Нью-Йорк",
    "Эйфелева башня": "Париж",
    "Большой Китайская стена": "Пекин"
}
def quiz(landmarks):
    correct = 0
    wrong = 0
    landmarks_list = list(landmarks.keys())
    random.shuffle(landmarks_list)
  
    for i in landmarks_list:
        capital = landmarks[i]
        answer = input(f"Введите столицу города, в котором находится {i}: ").strip().capitalize()
        if answer == capital:
            print("Правильно!")
            correct += 1
        else:
            print(f"Неправильно. Правильный ответ: {capital}")
            wrong += 1
    print("\nРезультаты:")
    print(f"Правильных ответов: {correct}")
    print(f"Неправильных ответов: {wrong}")
quiz(landmarks)