#3. Шифрование и дешифрование файлов. Напишите программу, которая применяет словарь для присвоения "кодов" каждой букве алфавита. 
# Например: codes={'А':'%’,’а’:’9’,’Б’ :’@',’б’:’#’…} Здесь букве А присвоен символ %, букве а - число 9, букве Б - символ @ и т. д.
# Программа должна открыть заданный текстовый файл, прочитать его содержимое и применить словарь для записи зашифрованной версии
# содержимого файла во второй файл. Каждый символ во втором файле должен содержать код для соответствующего символа из первого файла. 
# Напишите вторую программу, которая открывает зашифрованный файл и показывает его дешифрованное содержимое на экране.

codes = {
    "А": "%", "а": "9", "Б": "@", "б": "#", "В": "*", "в": "8",
    "Г": "&", "г": "7", "Д": "^", "д": "6", "Е": ":", "е": "5",
    "Ё": ";", "ё": "4", "Ж": "$", "ж": "'", "З": ".", "з": "3",
    "И": "|", "и": "\\", "Й": "/", "й": "2", "К": "1", "к": "!",
    "Л": "~", "л": "0", "М": "(", "м": ")", "Н": "-", "н": "_",
    "О": "+", "о": "=", "П": "{", "п": "}", "Р": "[", "р": "]",
    "С": "<", "с": ">", "Т": "?", "т": '"', "У": "№", "у": "a",
    "Ф": "A", "ф": "N", "Х": "n", "х": "M", "Ц": "m", "ц": "L",
    "Ч": "l", "ч": "k", "Ш": "K", "ш": "s", "Щ": "S", "щ": "e",
    "Ъ": "E", "ъ": "r", "Ы": "R", "ы": "i", "Ь": "I", "ь": "O",
    "Э": "C", "э": "j", "Ю": "J", "ю": "g", "Я": "G", "я": "o"}
file_name = "russian_text.txt"
encoded_file_name = "encoded_text.txt"
with open(file_name, "r", encoding="UTF-8") as file1:
    file_text = file1.read()
for i in codes.keys():
    file_text = file_text.replace(i, codes[i])
with open(encoded_file_name, "w") as file1:
    file1.write(file_text) 
print('Cохранен в файле encoded_text.txt')                                                                                                                                     